import { Text, Box } from "ink";

export function Banner() {
  return (
    <Box
      paddingX={2}
      paddingY={1}
    >
      <Box flexDirection="column" alignItems="center">
        <Text>{""}</Text>
        <Text color="white" bold>
██████╗ ███████╗ █████╗ ██████╗ ███████╗███╗   ██╗██████╗
</Text><Text color="white" bold>
██╔══██╗██╔════╝██╔══██╗██╔══██╗██╔════╝████╗  ██║██╔══██╗
</Text><Text color="white" bold>
██║  ██║█████╗  ███████║██║  ██║█████╗  ██╔██╗ ██║██║  ██║
</Text><Text color="white" bold>
██║  ██║██╔══╝  ██╔══██║██║  ██║██╔══╝  ██║╚██╗██║██║  ██║
</Text><Text color="white" bold>
██████╔╝███████╗██║  ██║██████╔╝███████╗██║ ╚████║██████╔╝
</Text><Text color="white" bold>
╚═════╝ ╚══════╝╚═╝  ╚═╝╚═════╝ ╚══════╝╚═╝  ╚═══╝╚═════╝ 
        </Text>
      </Box>
    </Box>
  );
}

